[
  {
    "id": 1,
    "companyLogoUrl": "./tourees.png",
    "companyName": "Seed Approach",
    "title": "Technical Lead",
    "startDate": "Feb 2024",
    "endDate": "Present",
    "align": "left",
    "paragraphs": [
      {
        "id": 1,
        "text": "Developed a platform that connects users with independent contractors who assist with various tasks, jobs, and errands via a mobile application built with React Native and Spring Boot."
      },
      {
        "id": 2,
        "text": "Implemented features allowing users to create tasks by specifying categories, descriptions, addresses, and dates, while contractors can accept and complete tasks using React and Redux."
      },
      {
        "id": 3,
        "text": "Led and mentored a team of three developers in building the mobile application in React Native and the RESTful API using Spring Boot."
      }
    ]
  },
  {
    "id": 2,
    "companyLogoUrl": "./tanco.png",
    "companyName": "Tanco LLC",
    "title": "Senior Full Stack Software Engineer",
    "startDate": "Jun 2022",
    "endDate": "Apr 2023",
    "align": "right",
    "paragraphs": [
      {
        "id": 1,
        "text": "Single-handily built an online store for a retail company using React, Redux, and Spring Boot, with a product catalog, shopping cart, user account management, order management, promotions and discounts, and interactive find store locations on the map feature."
      },
      {
        "id": 2,
        "text": "Created an admin panel using React enabling administrators to manage user accounts, product catalogs, orders, stores, and promotions, while providing data visualizations for sales and order insights."
      },
      {
        "id": 3,
        "text": "Automated the shipping process by integrating with a third-party shipment system, reducing shipment delays and cutting shipment costs by 15%."
      }
    ]
  },
  {
    "id": 3,
    "companyLogoUrl": "./iotech.png",
    "companyName": "IOtech LLC",
    "title": "Senior Full Stack Software Engineer",
    "startDate": "Sep 2021",
    "endDate": "Jun 2022",
    "align": "left",
    "paragraphs": [
      {
        "id": 1,
        "text": "Created RESTful API with 8 microservices for a sales rep order management mobile application using Spring Cloud Discovery, Spring Cloud Config, Spring Cloud Gateway, and OAuth by Keycloak."
      },
      {
        "id": 2,
        "text": "Created an admin web application in React and Ant Design for managing user accounts, products, promotions, stores, orders, and daily tasks of sales reps."
      },
      {
        "id": 3,
        "text": "Developed a sales rep order management mobile application in Flutter and GetX, reducing sales process time by 30%."
      }
    ]
  },
  {
    "id": 3,
    "companyLogoUrl": "./khanbank.svg",
    "companyName": "Khan Bank JSC",
    "title": "Senior Full Stack Software Engineer",
    "startDate": "Jun 2019",
    "endDate": "Jun 2021",
    "align": "right",
    "paragraphs": [
      {
        "id": 1,
        "text": "Developed online payment modules for intra-bank, ACH, and SWIFT transactions in web and mobile banking applications using React, React Native, and Redux reducing payment processing time by 15% for over 1.5 million customers."
      },
      {
        "id": 2,
        "text": "Collaborated with a DevOps team to build CI/CD pipelines by containerizing microservices using Docker and measuring code coverage with SonarQube and JaCoCo."
      },
      {
        "id": 3,
        "text": "Managed a team of 8 developers in developing microservices in Spring Boot and web applications in Angular."
      }
    ]
  },
  {
    "id": 3,
    "companyLogoUrl": "./khanbank.svg",
    "companyName": "Khan Bank JSC",
    "title": "Full Stack Software Engineer",
    "startDate": "Feb 2017",
    "endDate": "Jun 2019",
    "align": "right",
    "paragraphs": [
      {
        "id": 1,
        "text": "Converted a banking system from monolithic to microservice architecture by developing document processing, task management, and transaction microservices with Spring Boot and Kafka."
      },
      {
        "id": 2,
        "text": "Developed authentication, authorization, and banking teller modules for an Angular intranet system used in 500+ branches."
      },
      {
        "id": 3,
        "text": "Improved document processing efficiency with a Spring Boot microservice and Angular web application, decreasing average customer service time by 20%."
      }
    ]
  },
  {
    "id": 3,
    "companyLogoUrl": "./monott.png",
    "companyName": "MONOTT LLC",
    "title": "Full Stack Software Engineer",
    "startDate": "Mar 2016",
    "endDate": "Nov 2016",
    "align": "left",
    "paragraphs": [
      {
        "id": 1,
        "text": "Designed and developed web applications for music and sports streaming using AngularJS."
      },
      {
        "id": 2,
        "text": "Developed RESTful APIs with Django REST Framework and integrated them with the Wowza video platform for on-demand services."
      }
    ]
  }
]
