[
  {
    "id": 2,
    "icon": "typescript",
    "name": "TypeScript",
    "order": 3,
    "description": "For the past 8 years, I've been developing complex web applications using TypeScript, especially with Angular and React. TypeScript has helped me enforce static types, improve code maintainability, and reduce runtime errors in large-scale projects.",
    "yearsOfExperience": 7,
    "type": "development"
  },
  {
    "id": 3,
    "icon": "spring",
    "name": "Spring",
    "order": 1,
    "description": "I have been building microservices using Spring Boot, focusing on creating scalable and resilient architectures using Spring Cloud features.",
    "yearsOfExperience": 7,
    "type": "development"
  },
  {
    "id": 5,
    "icon": "react",
    "name": "React & React Native",
    "description": "I have built dynamic web and mobile applications with React and React Native, serving over 1.5 million customers. My expertise includes component-based architecture, state management (Redux), and optimizing performance for both web and mobile platforms.",
    "yearsOfExperience": 4,
    "type": "development"
  },
  {
    "id": 6,
    "icon": "angular",
    "color": "EE1918",
    "name": "Angular",
    "description": "In my 4 years of experience with Angular, I’ve developed reusable UI components and converted them into npm packages for enterprise-level applications. My focus has been on improving developer efficiency through modular and maintainable code.",
    "yearsOfExperience": 4,
    "type": "development"
  },
  {
    "id": 7,
    "icon": "flutter",
    "name": "Flutter & Dart",
    "description": "I developed a mobile application using Flutter & Dart, which included features like order management and user profiles. Flutter’s cross-platform capabilities allowed me to deliver the app efficiently on both Android and iOS.",
    "yearsOfExperience": 2,
    "type": "development"
  },
  {
    "id": 9,
    "icon": "django",
    "color": "103E2E",
    "order": 2,
    "name": "Django & Python",
    "description": "I have used Django to build full-stack web applications including music and sport streaming web applications. Django’s powerful ORM and admin interface accelerated development and simplified database management.",
    "yearsOfExperience": 1,
    "type": "development"
  },
  {
    "id": 11,
    "icon": "redux",
    "name": "Redux",
    "description": "I’ve used Redux extensively for managing application state in React and React Native projects, enabling predictable and maintainable state management in complex applications.",
    "yearsOfExperience": 4,
    "type": "development"
  },
  {
    "id": 12,
    "icon": "./leadership.svg",
    "name": "Leadship",
    "description": "Over the past four years as a Senior Software Engineer, I've led teams of 5-10 developers to successfully complete projects while also mentoring junior developers.",
    "yearsOfExperience": 4,
    "type": "soft"
  },
  {
    "id": 13,
    "icon": "./java.png",
    "name": "Java",
    "order": 2,
    "description": "I have used Java to build large-scale backend systems, focusing on building microservices with Spring Boot. Java’s performance and reliability make it my preferred language for developing scalable, enterprise-grade applications.",
    "yearsOfExperience": 7,
    "type": "development"
  },
  {
    "id": 14,
    "icon": "docker",
    "name": "Docker",
    "order": 1,
    "description": "I have been using Docker for containerizing microservices, improving development workflows, and streamlining the deployment process. Docker has helped maintain consistency across environments and reduced configuration issues.",
    "yearsOfExperience": 4,
    "type": "tools"
  },
  {
    "id": 15,
    "icon": "antdesign",
    "name": "Ant Design",
    "order": 1,
    "description": "I have used Ant Design since 2021 to create clean, responsive UI components for enterprise applications. By leveraging its rich component library, I improved development speed and ensured design consistency across multiple projects.",
    "yearsOfExperience": 2,
    "type": "development"
  },
  {
    "id": 16,
    "icon": "apachecassandra",
    "name": "Cassandra",
    "order": 1,
    "description": "I have utilized Cassandra for managing distributed, large-scale data systems. Cassandra's decentralized structure allowed me to build fault-tolerant, highly available databases for mission-critical applications.",
    "yearsOfExperience": 2,
    "type": "database"
  },
  {
    "id": 17,
    "color": "2F99EF",
    "icon": "apachekafka",
    "name": "Kafka",
    "order": 1,
    "description": "I began using Apache Kafka in 2020 for building event-driven microservices, enabling scalable and real-time data streaming between different components of the system.",
    "yearsOfExperience": 4,
    "type": "tools"
  },
  {
    "id": 18,
    "icon": "./apigee.png",
    "name": "APIGEE",
    "order": 1,
    "description": "In 2019, I started utilizing APIGEE for API management, focusing on securing, monitoring, and analyzing API traffic for large-scale microservices architectures.",
    "yearsOfExperience": 2,
    "type": "tools"
  },
  {
    "id": 19,
    "icon": "redis",
    "name": "Redis",
    "order": 1,
    "description": "I have integrated Redis into various microservices for caching and session management, resulting in improved application performance and reduced load times for data retrieval.",
    "yearsOfExperience": 2,
    "type": "database"
  },
  {
    "id": 20,
    "icon": "jenkins",
    "name": "Jenkins",
    "order": 3,
    "description": "I have used Jenkins for automating CI/CD pipelines, ensuring seamless code integration, testing, and deployment. Jenkins helped me streamline release cycles and maintain a consistent production environment for a banking system.",
    "yearsOfExperience": 1,
    "type": "tools"
  },
  {
    "id": 21,
    "icon": "amazonwebservices",
    "color": "FF9C15",
    "name": "AWS",
    "order": 1,
    "description": "I have deployed, managed, and scaled applications using AWS services such as EC2, S3, and RDS. My focus has been on creating highly available and fault-tolerant architectures for web applications.",
    "yearsOfExperience": 1,
    "type": "development"
  },
  {
    "id": 22,
    "icon": "elasticstack",
    "name": "ELK Stack",
    "order": 1,
    "description": "I have used the ELK Stack to set up centralized logging and real-time monitoring for microservices architectures. By analyzing logs and metrics, I was able to improve system observability and performance troubleshooting.",
    "yearsOfExperience": 4,
    "type": "tools"
  },
  {
    "id": 23,
    "icon": "oracle",
    "name": "Oracle",
    "order": 1,
    "description": "I have worked with Oracle to handle relational data for banking applications, focusing on query optimization, transaction management.",
    "yearsOfExperience": 4,
    "type": "database"
  },
  {
    "id": 24,
    "icon": "sonarqube",
    "name": "SonarQube",
    "order": 1,
    "description": "I have incorporated SonarQube into the development pipeline to automate static code analysis, ensuring code quality, security, and adherence to best practices, reducing technical debt in large-scale projects.",
    "yearsOfExperience": 3,
    "type": "tools"
  },
  {
    "id": 25,
    "icon": "mysql",
    "name": "MySQL",
    "description": "I’ve worked with MySQL for 5 years, designing and managing databases for high-traffic web applications. I focused on indexing, query optimization, and database scaling to ensure efficient data management.",
    "yearsOfExperience": 5,
    "type": "database"
  },
  {
    "id": 26,
    "icon": "junit5",
    "name": "JUnit",
    "description": "I’ve been using JUnit to create comprehensive unit tests for Java applications, ensuring robust code quality and minimizing production issues. I also integrated JUnit tests into CI/CD pipelines for automated testing.",
    "yearsOfExperience": 5,
    "type": "development"
  },
  {
    "id": 27,
    "icon": "jest",
    "name": "Jest",
    "description": "I have used Jest for testing JavaScript applications, particularly with React. Jest’s fast and reliable testing helped ensure that complex web applications were well-tested before release.",
    "yearsOfExperience": 4,
    "type": "development"
  },
  {
    "id": 28,
    "icon": "./cross-functional.png",
    "name": "Cross Functional Teams",
    "description": "In my role as a Senior Software Engineer, I have collaborated with cross-functional teams, working closely with product, design, and QA teams to deliver projects efficiently and meet business goals.",
    "yearsOfExperience": 4,
    "type": "soft"
  }
]
